app/controllers/colors_controller.rb

  def index
    @colors = Color.all
---
SELECT "colors".* FROM "colors"

  def create
    Color.create(name: params['name'])
---
INSERT INTO "colors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "amarelo"], ["created_at", "2019-11-11 15:07:35.350771"], ["updated_at", "2019-11-11 15:07:35.350771"]]