app/controllers/items_controller.rb

  def index
    @items = Product.all
---
SELECT "products".* FROM "products"

  def create
    Product.create(item_params)
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Calca"], ["description", "Skini"], ["created_at", "2019-11-11 16:27:44.067077"], ["updated_at", "2019-11-11 16:27:44.067077"]]