app/controllers/products_controller.rb

  def index
    @products = AvailableProduct.all.order([:product_id,:color_id])
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1
SELECT "available_products".* FROM "available_products"  ORDER BY "available_products"."product_id" ASC, "available_products"."color_id" ASC

  def create
    product = ProductBuilder.new(product_params).build

    redirect_to :back if product.save!
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "xampuuuuu"], ["description", "Cai o cabelo"], ["created_at", "2019-11-11 14:52:01.863322"], ["updated_at", "2019-11-11 14:52:01.863322"]]