app/controllers/sizes_controller.rb

  def index
    @sizes = Size.all.order(:id)
---
SELECT "sizes".* FROM "sizes"  ORDER BY "sizes"."id" ASC

  def create
    Size.create(name: params['size'])
---
INSERT INTO "sizes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "1"], ["created_at", "2019-11-11 15:46:18.729828"], ["updated_at", "2019-11-11 15:46:18.729828"]]