app/views/products/index.html.erb

            <td class="text-center"> <%= product.color.capitalize %> </td>
            <td class="text-center"> <%= product.size %> </td>
---
SELECT  "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT 1  [["id", 4]]